# SQL Lab

Congratulations! We've been hired as analysts at Classic Model Car Company, and you've been handed keys to the Data Warehouse.  They want you to hit the ground running with analysis! We have lots of questions to answer.  First, let's connect to the database.

1. Connect via MySQL Credentials
  - hostname: `hbs-ds-060120.c1doesqrid0e.us-east-1.rds.amazonaws.com`
  - username: `hbs-student`
  - password: (distributed via slack)
  - port: 3306 (default)
  - database: `classicmodels`

2. Take a moment to study the schema, noting the keys. Browse the data in each relation if you wish. Answer the following queries. I've given you the expected results below each query.

3. Answer the following questions! Do them in your MySQL client first, most likely, then bring them into Pandas here in this notebook.

1. List all customer names and their addresses who don't have a specified sales rep. Order by customer name.

In [1]:
import pandas as pd

In [2]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.20-cp37-cp37m-win_amd64.whl (4.3 MB)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.12.2-cp37-cp37m-win_amd64.whl (1.0 MB)
Requirement already satisfied: six>=1.9 in c:\users\cxu19\anaconda\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.14.0)
Requirement already satisfied: setuptools in c:\users\cxu19\anaconda\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (45.2.0.post20200210)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.20 protobuf-3.12.2

In [3]:
import mysql.connector

con = mysql.connector.connect(user='hbs-student', password='super-secure-password?',
                              host='hbs-ds-060120.c1doesqrid0e.us-east-1.rds.amazonaws.com',
                              database='classicmodels')

In [6]:
pd.read_sql_query("""
SELECT	contactLastName, 
		contactFirstName,
        addressLine1,
        addressLine2,
        city,
        state,
        postalCode,
        country,
        salesRepEmployeeNumber
FROM classicmodels.customers
WHERE	salesRepEmployeeNumber IS NULL
ORDER BY 1""", con)

,contactLastName,contactFirstName,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber
0,"Altagar,G M",Raanan,3 Hagalim Blv.,None,Herzlia,None,47625,Israel,None
1,Andersen,Mel,Obere Str. 57,None,Berlin,None,12209,Germany,None
2,Anton,Carmen,"c/ Gobelas, 19-1 Urb. La Florida",None,Madrid,None,28023,Spain,None
3,Camino,Alejandra,"Gran Vía, 1",None,Madrid,None,28001,Spain,None
4,Cramer,Philip,Maubelstr. 90,None,Brandenburg,None,14776,Germany,None
5,de Castro,Isabel,Estrada da saúde n. 58,None,Lisboa,None,1756,Portugal,None
6,Feuer,Alexander,Heerstr. 22,None,Leipzig,None,04179,Germany,None
7,Franken,Peter,Berliner Platz 43,None,München,None,80805,Germany,None
8,Harrison,Ed,Rte des Arsenaux 41,None,Fribourg,None,1700,Switzerland,None
9,Josephs,Karin,Luisenstr. 48,None,Münster,None,44087,Germany,None
10,Kloss,Horst,Taucherstraße 10,None,Cunewalde,None,01307,Germany,None
11,Kuger,Armand,1250 Pretorius Street,None,Hatfield,Pretoria,0028,South Africa,None
12,McKenna,Patricia,8 Johnstown Road,None,Cork,Co. Cork,None,Ireland,None
13,Messner,Renate,Magazinweg 7,None,Frankfurt,None,60528,Germany,None
14,Moos,Hanna,Forsterstr. 57,None,Mannheim,None,68306,Germany,None
15,Müller,Rita,Adenauerallee 900,None,Stuttgart,None,70563,Germany,None
16,Ottlieb,Sven,Walserweg 21,None,Aachen,None,52066,Germany,None
17,Piestrzeniewicz,Zbyszek,ul. Filtrowa 68,None,Warszawa,None,01-012,Poland,None
18,Rodriguez,Lino,Jardim das rosas n. 32,None,Lisboa,None,1675,Portugal,None
19,Schuyler,Bradley,Kingsfordweg 151,None,Amsterdam,None,1043 GR,Netherlands,None
20,Semenov,Alexander,2 Pobedy Square,None,Saint Petersburg,None,196143,Russia,None
21,Walker,Brydey,Suntec Tower Three,8 Temasek,Singapore,None,038988,Singapore,None

2. List the names of all customers that have a creditLimit between 100,000 and 200,000 inclusively. Order by customer name.

In [ ]:
SELECT	contactLastName, 
		contactFirstName,
        addressLine1,
        addressLine2,
        city,
        state,
        postalCode,
        country,
        salesRepEmployeeNumber,
        creditLimit
FROM classicmodels.customers
WHERE	creditLimit >= 100000 AND creditLIMIT <= 200000
ORDER BY 1;


3. List all employees who have the initials of M.P. or P.M., by name. Order by last name.

In [ ]:
SELECT 
    left(lastName,1),
    left(firstName,1),
    lastName,
    firstName
FROM classicmodels.employees
WHERE 
	left(lastName, 1) = 'P' AND left(firstName, 1) = 'M' OR
    left(lastName, 1) = 'M' AND left(firstName, 1) = 'P'
ORDER BY 1

4. List all the products' productNames purchased by Mini Wheels Co. Order the list by product line.

In [ ]:
SELECT 
	productName,
    customerName,
    productLine
FROM products
JOIN orderdetails USING (productCode)
JOIN orders USING (orderNumber)
JOIN customers USING (customerNumber)
WHERE customerName = 'Mini Wheels Co.'
ORDER BY productLine

5. List the customers by customerName whose contact person shares either a first name or last name with any of the company's employees Order by customerName

In [ ]:
SELECT 
	customerName,
    employees.LastName,
    employees.FirstName,
    contactlastName,
    contactfirstName
FROM customers
JOIN employees ON salesRepEmployeeNumber = employees.employeeNumber
WHERE contactFirstName = employees.firstName OR contactLastName = employees.lastName
ORDER BY 1

7. List the customers (by name) that are based in the country which is first in the lexicographic order of customer countries. Order by customerName

In [ ]:
SELECT 
	customerName
From customers 
WHERE country = 
(SELECT
	country
From customers 
ORDER BY country
LIMIT 1)

8. Identify the product(s) by productCode and productName that the company has the least stock of. Order by product code.

In [ ]:
SELECT 
	productCode,
    productName,
    quantityInStock
FROM products
WHERE quantityInStock < 1000
ORDER BY productCode

9. Identify the offices (by city) that have the least employees and the most employees (answer should include city, numEmps)

In [8]:
pd.read_sql_query(""" 
SELECT city, count(*) as employeeCount
FROM employees
JOIN offices USING (officeCode)
GROUP BY officeCode, city

HAVING employeeCount IN (
	SELECT max(employeeCount)
	FROM (
	SELECT officeCode, count(*) as employeeCount
	FROM employees
	GROUP BY officeCode) as max_count 
	UNION
    SELECT min(employeeCount)
    FROM (
    SELECT officeCode, count(*) as employeeCount
	FROM employees
	GROUP BY officeCode) as min_count
)""", con)

            city  employeeCount
0  San Francisco              6
1         Boston              2
2            NYC              2
3          Tokyo              2
4         London              2

In [ ]:
SELECT 
	COUNT(lastName) as employee_count,
    officeCode,
    city
FROM classicmodels.employees
JOIN offices USING (officeCode)
GROUP BY officeCode
ORDER BY employee_count

10. For all Sales Reps list their names (first and last) and the name of the office they work out of and the number of clients they represent. Order by reverse order of numClients

In [ ]:
SELECT 
	lastName,
    firstName,
    jobTitle,
    offices.city,
    count(customerName) as numClients
FROM classicmodels.employees
JOIN offices USING (officeCode) 
JOIN customers ON employeeNumber = customers.salesRepEmployeeNumber
WHERE jobTitle = 'Sales Rep'
GROUP BY lastName
ORDER BY numClients ASC

11. List the customer(s) and their total payments (answer should include customerNumber, customerName, totalPayment where totalPayment is the total amount of dollars the customer has paid). Order by totalPayment.

In [ ]:
SELECT 
	customerNumber,
    customerName,
    SUM(amount) as totalPayment
FROM classicmodels.customers
JOIN payments using (customerNumber)
GROUP BY customerNumber
ORDER BY totalPayment DESC

12. List the product number, product name, and customer name such that the customer has never ordered that product. Order by customerName, productCode.

13. List the profit per product that the company would make if it were able to sell all of that product at MSRP (answer should include productName, profit). Order by profit.

14. List the average order size for each customer (answer should include customerName, avgQuantity) Order by customer name.